{"http://www.nydailynews.com/autos/acura/acura-nsx-2017-1.2799320": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Acura NSX Overview", "overview": "Don’t call it a comeback. Or perhaps you should. Having graced many walls, from bedrooms to garages, the Acura NSX was easy poster fodder in the 90s. But few updates late into its first generation eventually saw the supercar’s discontinuation in 2005, when it was still equipped with a cassette player. But with a dedicated manufacturing facility in Marysville, Ohio, the all-new 2017 NSX is setting roots that it plans to stay a while."}, "http://www.nydailynews.com/autos/audi/audi-tt-coupe-2017-1.2818268": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Audi TT and TTS Coupe Overview", "overview": "Cozy two-door coupes are losing out to sedans which are losing out to (sub)compact SUVs. But if you build it, they will buy it, right? More mundane in its third-generation design (the vehicle was all-new last year), the Audi TT Coupe still offers a peppy and dynamic drive. For the 2017 model year, the carry model receives minimal changes."}, "http://www.nydailynews.com/autos/ford/ford-mustang-convertible-2017-1.2896407": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Ford Mustang Convertible Overview", "overview": "The Ford Mustang Convertible has a long and storied history, and it's as relevant today as it was decades ago when it first made a splash on the automotive scene. This handsome drop-top engages with poised handling and modern feature content."}, "http://www.nydailynews.com/autos/chevrolet/chevrolet-corvette-coupe-2017-1.2896143": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Chevrolet Corvette Coupe Overview", "overview": "The Chevrolet Corvette Coupe takes the familiar sports-car formula and gives it a uniquely American spin. Its lines undulate like the curves of an hourglass, and its performance is visceral and memorable."}, "http://www.nydailynews.com/autos/fiat/fiat-124-spider-report-2017-1.2651007": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Fiat 124 Spider Overview", "overview": "Because it is based on the same platform and is built in the same Japanese factory as the Mazda MX-5 Miata, the reborn Fiat 124 Spider is known within the auto industry and among car enthusiasts as the “Fiata.” Hey, nicknames have been worse."}, "http://www.nydailynews.com/autos/nissan/nissan-370z-coupe-2017-1.2774557": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Nissan 370Z Coupe Overview", "overview": "Many sports-car buyers have a simple and basic mandate: They expect their vehicles to provide engaging performance. The Nissan 370Z coupe delivers on this front, and it sweetens the pot by offering stylish sheet metal and a handsome cabin. The coupe is mostly unchanged for 2017."}, "http://www.nydailynews.com/autos/bmw/bmw-i8-2017-1.2965599": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 BMW i8 Overview", "overview": "Plug-in hybrids aren't usually purchased for their handling capabilities, but the 2017 BMW i8 brings something different to this frugal and sensible segment. It offers spirited driving dynamics, and its flamboyant styling bears testimony to the fact that this is a true top-dollar exotic."}, "http://www.nydailynews.com/autos/mercedes-benz/mercedes-benz-amg-gt-2017-1.2973284": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Mercedes-Benz AMG GT Overview", "overview": "Sports cars are all about performance, and the best of the bunch win you over by providing blistering acceleration and scalpel-sharp handling. The 2017 Mercedes-Benz AMG GT delivers all this, and it makes its proposition even more attractive by throwing in stunning sheet metal and a fabulously crafted interior. It's easily one of the most tempting exotics on the market."}, "http://www.nydailynews.com/autos/porsche/porsche-718-boxster-boxster-s-2017-1.2862680": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Porsche 718 Boxster and Boxster S Overview", "overview": "Porsche’s entry-level roadster is so well-balanced that it’s often been assumed that the little Boxster could dethrone the 911 with some more power – if Porsche was willing to do so, of course."}, "http://www.nydailynews.com/autos/ford/ford-gt-2017-1.2999771": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Ford GT Overview", "overview": "Ford revives the GT nameplate for 2017, rolling out a coupe with the goods to go head to head with any European exotic. Made of lightweight carbon fiber, the 2017 Ford GT weds futuristic curves with spellbinding driving dynamics."}, "http://www.nydailynews.com/autos/audi/audi-tt-roadster-2017-1.2818276": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Audi TT Roadster Overview", "overview": "A drop-top sunshine soaker inexplicably ups the fun factor when it comes to driving. Add “sports car” to the equation and the numbers will almost always equal winner. Through three generations, the Audi TT, whether in coupe or roadster form, has been a reassuring and dependable performer. Although a carryover model for 2017, it remains a safe bet for sports car lite enjoyment."}, "http://www.nydailynews.com/autos/chevrolet/chevrolet-corvette-convertible-2017-1.2896131": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Chevrolet Corvette Convertible Overview", "overview": "With its voluptuous exterior and breathtaking performance, the Chevrolet Corvette Convertible makes a strong case for buying American in a market filled with seductive European talent. Its power is prodigious, and it thrills the senses with its well-honed handling."}, "http://www.nydailynews.com/autos/ford/ford-mustang-coupe-2017-1.2896468": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Ford Mustang Coupe Overview", "overview": "The Ford Mustang Coupe has been in the game for more than a minute, and it owes its iconic status to an ability to deliver fun-loving performance that comes with few compromises. With a relatively roomy trunk and an upscale cabin, this sports coupe makes an amiable consort for most escapades."}, "http://www.nydailynews.com/autos/porsche/porsche-911-convertible-2017-1.2994594": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Porsche 911 Convertible Overview", "overview": "The Porsche 911 Convertible is an icon to those who value blistering acceleration and relentlessly keen driving dynamics. This talented convertible also brings heaping servings of luxury to the mix, thanks to its plushly appointed cabin and generous array of feature content."}, "http://www.nydailynews.com/autos/audi/audi-r8-2017-1.2799336": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Audi R8 Overview", "overview": "The all-new, second-generation Audi R8 was unveiled in Geneva last year with a Spyder model following suit in a New York debut back in March. Touted as the fastest production Audi ever built, the 2017 R8 boasts a 0-60 mph time of 3.2 seconds and a top speed of 205 mph. Even if you have no Le Mans aspirations, the R8 is plenty fast and plenty pretty for a weekend of winding roads."}, "http://www.nydailynews.com/autos/porsche/porsche-718-cayman-cayman-s-2017-1.2862666": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Porsche 718 Cayman and Cayman S Overview", "overview": "It may look just like the two-seat sports car purists have come to know and love, but there’s an all-new heart under the skin of the 718 Cayman and Cayman S. With two new turbocharged flat 4-cylinder engines, this is essentially an all-new sports car, but fear not – Porsche is not one to make missteps."}, "http://www.nydailynews.com/autos/alfa-romeo/alfa-romeo-4c-coupe-2017-1.2985543": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Alfa Romeo 4C Coupe Overview", "overview": "A long list of feature content is great, but it can add to a sports car's curb weight in ways that hinder performance. You won't have this problem with the Alfa Romeo 4C Coupe. This sleek sports car keeps things free and light with its carbon-fiber chassis and bare-bones list of amenities. The payoff is stunningly sharp handling and strong fuel economy."}, "http://www.nydailynews.com/autos/porsche/porsche-911-coupe-2017-1.2994586": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Porsche 911 Coupe Overview", "overview": "The Porsche brand is synonymous with peerless driving excitement, and the 911 Coupe has long been the model in the manufacturer's lineup that leads the charge. The 2017 Porsche 911 Coupe impresses with its distinctive styling, precise driving dynamics, and keen eye for luxury."}, "http://www.nydailynews.com/autos/porsche/porsche-panamera-2017-1.2994606": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Porsche Panamera Overview", "overview": "The Panamera gives enthusiast drivers who need a car that's larger than the typical Porsche coupe a chance to savor the best of all worlds. The roomy Panamera provides a deluxe cabin, and its hatchback design gives it a measure of versatility that isn't found in traditional sedans. When you team all this with its flawless handling, it's easy to see why the Panamera is a top pick its class. A hybrid variant is available."}, "http://www.nydailynews.com/autos/lexus/lexus-rc-2017-1.2991766": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Lexus RC Overview", "overview": "Luxury sport coupes are intended to provide sharp performance and good-looking styling. The 2017 Lexus RC is packaged in aggressive sheet metal that makes a bold statement. It's not as sporty as certain rivals, but in true Lexus fashion, it makes up for this by delivering smooth handling that will keep you comfortable even on long commutes. A performance-oriented variant—the Lexus RC F—is available."}, "http://www.nydailynews.com/autos/dodge/dodge-viper-2017-1.2816891": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Dodge Viper Overview", "overview": "The Dodge Viper has always been about just one thing: getting you from A to B really, really quickly. Certain niceties fall by the wayside in this quest. Specifically, ride quality can be overly firm and the seats aren't always very welcoming. Still, if you worship at the altar of speed, these sacrifices are small ones to make. Six special-edition models have been launched to commemorate the Viper's final year of production."}, "http://www.nydailynews.com/autos/nissan/nissan-gt-r-2017-1.2774588": {"summary": {"MPG": [" NA / NA ", " City HWY "], "HORSEPOWER": ["NA", "NA"], "MSRP": ["NA", "NA"]}, "title": "2017 Nissan GT-R Overview", "overview": "Nissan's GT-R owes its success to a very specific and appealing formula: It delivers engaging handling paired with a very livable driving experience. For 2017, this sports car gets a refresh that boosts its attractiveness in certain key areas."}}