{"http://www.nydailynews.com/autos/toyota/toyota-tundra-2017-1.2793755": {"overview": "Launched domestically in 2000, the Toyota Tundra was one of the first imports to compete in a segment that had up until then been resolutely red, white and blue. Its Toyota reliability has won it some fans, but historically, it's had a hard time measuring up to the segment's heavy hitters. The truck gets trim upgrades and a couple of new colors for 2017.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Toyota Tundra Overview"}, "http://www.nydailynews.com/autos/ford/ford-f-series-super-duty-2017-1.2716929": {"overview": "Ford loves to tout up the fact that its F-Series lineup has been the best-selling vehicle in America for decades, but the reality is that they’ve stayed on the top of the heap for a reason.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Ford F-Series Super Duty Overview"}, "http://www.nydailynews.com/autos/chevrolet/chevrolet-silverado-1500-2017-1.2790079": {"overview": "Chevrolet does its best to keep the Silverado 1500 simple. Nevertheless, a wide variety of Silverado models are aimed at best serving a broad range of owner requirements while delivering maximum value.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Chevrolet Silverado 1500 Overview"}, "http://www.nydailynews.com/autos/honda/honda-ridgeline-report-2017-1.2676029": {"overview": "If you’re a traditional truck buyer, you may not have thought much of the original Honda Ridgeline when it debuted all the way back in 2006. With characteristics that set it apart (for better or worse) from traditional trucks – unibody construction, unconventional looks, all-wheel drive instead of 4-wheel drive – the Ridgeline was better at winning over SUV buyers with a want for an open-air bed than it was at converting long-time truck owners.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Honda Ridgeline Overview"}, "http://www.nydailynews.com/autos/nissan/nissan-titan-2017-1.2775693": {"overview": "The Nissan Titan was first launched in 2004, and in the years since, it's received only minor changes. Nissan finally gives the truck a top-to-bottom overhaul for 2017. The new half-ton Titan will initially be offered as a four-door Crew Cab, with Single Cab and King Cab variants to come in the months ahead.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Nissan Titan Overview"}, "http://www.nydailynews.com/autos/chevrolet/chevrolet-silverado-hd-2017-1.2896152": {"overview": "A heavy-duty truck is the go-to choice for tasks requiring the most muscle, and the Chevrolet Silverado HD is equipped to handily meet the massive towing and hauling needs of shoppers in this segment. The Silverado HD goes a step further by pairing this awesome might with ride quality that is surprisingly smooth and serene.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Chevrolet Silverado HD Overview"}, "http://www.nydailynews.com/autos/toyota/toyota-tacoma-2017-1.2793708": {"overview": "Last year, the Tacoma received a successful makeover that left it with a new 6-speed transmission, a new 3.5-liter V6 and upgraded styling. For 2017, the model welcomes a new generation of the rock-crawling TRD Pro variant to the lineup. This model is based on the current-generation Tacoma.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Toyota Tacoma Overview"}, "http://www.nydailynews.com/autos/nissan/nissan-titan-xd-2017-1.2775707": {"overview": "The Nissan Titan XD exists somewhere between light-duty trucks and heavy-duty models. It hauls more than your typical light-duty pickup, but it isn't as powerful as a heavy-duty truck. Its sibling is the Nissan Titan, but the two trucks are made with entirely different components, and the Titan XD is several inches longer and wider. The Titan XD was initially offered with just a diesel engine, but a gasoline V8 joins the roster for 2017.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Nissan Titan XD Overview"}, "http://www.nydailynews.com/autos/chevrolet/chevrolet-colorado-2017-1.2896103": {"overview": "The Chevrolet Colorado is a truck that's domesticated enough for suburban living. Its dimensions aren't overwhelming, and its ride quality is pleasant enough to make it an agreeable daily driver. This friendly Chevy also entices with a wealth of high-tech amenities.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Chevrolet Colorado Overview"}, "http://www.nydailynews.com/autos/nissan/nissan-frontier-2017-1.2907912": {"overview": "The midsize truck segment has loyal followers, and the 2017 Nissan Frontier delivers much of what these buyers want. The Frontier provides comfortable ride quality, and it comes with useful features such as a cargo tie-down system. With the Pro-4X trim, the Frontier offers a variant for those seeking to indulge in off-road explorations.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Nissan Frontier Overview"}, "http://www.nydailynews.com/autos/gmc/gmc-sierra-hd-2017-1.2993833": {"overview": "GMC’s heavy-duty lineup, the Sierra 2500 and 3500, might be the perfect combination of working class and business class, particularly when they are paired with diesel powertrains and dressed in their respective, chromed-out Denali packages.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 GMC Sierra HD Overview"}, "http://www.nydailynews.com/autos/ram/ram-heavy-duty-2017-1.2999726": {"overview": "Heavy-duty trucks are expected to have enough brawn to handle the largest loads. The 2017 Ram Heavy Duty delivers all the muscle you'd expect from a truck in this segment, and it adds a surprising level of refinement to the mix.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Ram Heavy Duty Overview"}, "http://www.nydailynews.com/autos/ram/ram-1500-2017-1.2790116": {"overview": "Fiat Chrysler Automobiles doesn’t build the oldest full-size truck design on the market – that distinction belongs to Toyota – but there is no denying that the Ram 1500 is in need of a redesign. Because if changes for 2017 are limited to additional standard equipment that boosts the Ram’s value equation, it would seem an all-new Ram is coming soon.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Ram 1500 Overview"}, "http://www.nydailynews.com/autos/gmc/gmc-canyon-2017-1.2858420": {"overview": "If you like the Chevrolet Colorado but want to feel more comfortable pulling your truck up to the valet, GMC has a solution for you. The 2017 Canyon is improved and re-vamped over the 2016 version, and remains one of the best pickup trucks money can buy.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 GMC Canyon Overview"}, "http://www.nydailynews.com/autos/ford/ford-f-150-2017-1.2790101": {"overview": "Equipped with a rugged steel frame and a lightweight aluminum body, the Ford F-150 is the best full-size truck you can buy – unless you’re planning to dump sharp objects into the unprotected bed from a payloader. If that’s the plan, then yes, get a truck with a steel bed.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 Ford F-150 Overview"}, "http://www.nydailynews.com/autos/gmc/gmc-sierra-1500-2017-1.2858536": {"overview": "Think of the GMC Sierra as a dressed-up Chevrolet Silverado: both trucks are essentially the same, but differ in terms of style. For 2017, the Sierra 1500 offers a few tweaks to help make it more enticing.", "summary": {"MSRP": ["NA", "NA"], "HORSEPOWER": ["NA", "NA"], "MPG": [" NA / NA ", " City HWY "]}, "title": "2017 GMC Sierra 1500 Overview"}}